[
	{
		"FilmName": "Breaking Bad",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/brba.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/brbaHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "5 sezon - 62 bolum / 42dk",
		"ReleaseDate": "2008-2013",
		"Director": "Vince Gilligan",
		"IMDB": "9,5",
		"Plot": "Lisede kimya öğretmenliği yapan Walter White bir gün doktordan ileri safhada akciğer kanseri olduğunu öğrenir. Kendisinden sonra geride kalan ailesine maddi birikim sağlamak isteyen Walter White, uyuşturucu yapımında ustalaşan eski bir öğrencisi, Jesse Pinkman ile beraber uyuşturucu işine girer. Elbetteki yasa dışı yollardan ve uyuşturucunun da eş anlamlısının bela olduğunu bilerek... Bir yanda kimya alanında önemli işlere imza atmış bir öğretmen, diğer yanda bu tehlikeli piyasayı çok iyi tanıyan, gözü pek bir 'eski öğrenci'... Yüksek kalitede ve saflıkta ürettikleri metamfetamin, onları uyuşturucu ticaretinin en riskli yollarına da bulaştıracak... Başrollerini deneyimli aktör Bryan Cranston veAaron Paulun paylaştığı Breaking Bad, orijinal öyküsü ve sürükleyici senaryosunun yanı sıra oyuncularına kazandırdığı Altın Küre adaylıkları, Emmy ve Saturn ödülleriyle de televizyon dizileri arasında kalitesini ve farkını belli eden bir yapım... 1990lı yılların kült bilim-kurgu dizisi The X Filesın ortak yapımcıları ve yazarları arasında yer alan Vince Gilliganın yapımcılığını üstlendiği dizi eleştirmenler tarafından da son yılların en başarılı yapımlarından biri olarak gösteriliyor..."
		
	},
	
	{
		"FilmName": "Babam ve Oğlum",
		"Country": "Türkiye",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/babamveoglum.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/babamveoglumHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "1sa 48dk",
		"ReleaseDate": "18 Kasım 2005",
		"Director": "Çağan Irmak",
		"IMDB": "8,3",
		"Plot": "Babam ve Oğlumda, 12 Eylül darbesinin yıktığı hayatlardan birinde yetişmektedir küçük Deniz. Annesini henüz doğmadan önce kaybetmiş, bir gazetede yazar olarak çalışan babası tarafından mütevazi bir evde yetiştirilmiştir. Babası dışında tanıdığı tek bir akrabası bile yoktur. Taki babası Sadık, bir gün Denizi şaşırtacak bir haberle gelene kadar... Deniz artık babasıyla birlikte, hiç görmediği dedesinin yanında, küçük bir kasabada yaşayacaktır. Köye vardıklarında Sadık yıllar önce küstüğü babasını ilk kez görüyordur. Aralarındaki bu üskünlük kolay kolay geçecek cinsten bir durum değildir. Sadığın dönüş sebebini anlamlandıramayan aile bir yandan çok mutluyken diğer yandan tedirgindir de. Zamanla Deniz bu hiç görmediği ailesine alışırken ve her şey düzelmeye başlamışken yaşanan bir dram herkesi derinden etkileyecektir. Son dönem sinemamızın en dokunaklı filmlerinden biri olarak kabul gören Babam ve Oğlum kendi türünde klasikleşmeye aday filmlerden biri."
		
	},
	{
		"FilmName": "The Shawshank Redemption",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shawshank.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shawshankHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "2sa 22dk",
		"ReleaseDate": "10 Mart 1994",
		"Director": " Frank Darabont",
		"IMDB": "9,3",
		"Plot": "Esaretin Bedeli, Andy ve Red isimli iki mahkumun parmaklıklar ardında kurdukları dünyanın hikayesini anlatıyor. Andy Dufresne, genç ve başarılı bir bankerdir. Karısını ve karısının sevgilisini öldürmek suçundan yargılanır ve ömür boyu hapis cezası alır. Shawsank Hapishanesinde dayak, işkence, tecavüz, her türlü durum yaşanmaktadır fakat Andy gene de hayata bağlı ve iyimserdir. Bu tutumu etrafındakileri de etkiler. Andy umutlu bakış açısıyla çevresindeki tüm mahkumları, parmaklıklar arkasında bile özgür bir yaşam olabileceğine inandırır. Andy'nin bu çabalarına ortak olacak bir arkadaşı da olacaktır: Red.Bir Stephen King uyarlaması olan filmde Morgan Freeman ve Tim Robbins başrolde. Film, 1995'te, aralarında en iyi film adaylığı da olmak üzere tam 7 dalda Oscara aday gösterildi."
	},
	{
		"FilmName": "The Intouchables",
		"Country": "Fransa",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/intouchables.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/intouchablesHeader.png",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "1sa 52dk",
		"ReleaseDate": "11 Mayıs 2011",
		"Director": "Eric Toledano, Olivier Nakache",
		"IMDB": "8,5",
		"Plot": "Can Dostum, felçi bir adam ve ona bakıcılık yapan gencin hikayesini anlatıyor. Zengin bir iş adamı ve aristokrat olan Philippe, yamaç paraşütü yaparken geçirdiği kaza sonrası felç olur ve boynundan aşağısı kullanamaz hale gelir. Driss ise hapishaneden henüz yeni çıkmış bir işsizdir. Philippe 7 gün 24 saat boyunca bakımını üstlenmesi için Drissi evine yatılı yardımcı olarak alınca ikisinin de dünyası değişecektir. Normal şartlar altında hiçbir zaman yan yana gelmeyecek bu ikili iyisiyle kötüsüyle hayatın tadını beraber çıkarmaya başlarlar. Fransada geçtiğimiz kasım ayında vizyona giren film, hayatta bir noktadan sonra kültür ve sınıf farklılıklarının ortadan kalkması temasına odaklanan ve dram-mizah arasında gidip gelen bir yapım. Fransız sinemacılar Olivier Nakache ve Eric Toledano'nun beraber yazıp yönettiği filmin başrollerinde ise François Cluzet ve Omar Sy var."
	},
	{
		"FilmName": "Forrest Gump",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/forrest.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/forrestHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "2sa 20dk",
		"ReleaseDate": "11 Nisan 1994",
		"Director": "Robert Zemeckis",
		"IMDB": "8,8",
		"Plot": "Forrest Gump, düşük I.Q. sahibi genç bir adamdır. Jenny ile tanıştığında ona aşık olur. Gump aralarında Elvis Presley, Kennedy, Nixonın da olduğu tarihsel kişilerle kaza eseri tanışır ve 50’lerden 70lerin sonuna kadar gelen bir süre zarfında olaylar gelişir. Gump tamamen tesadüf olarak Vietnam savaşına ve Amerikan yakın tarihinin önemli olaylarına şahitlik eder ve hatta rol alır. Ancak bilmeden yaptıklarının ne kadar önemli sonuçları olduğundan da haberi yoktur."
		
	},
	{
		"FilmName": "The Green Mile",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenMile.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenMileHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "3sa 9dk",
		"ReleaseDate": "17 Mart 1999",
		"Director": "Frank Darabont",
		"IMDB": "8,6",
		"Plot": "Yeşil Yol, bir hapishane görevlisi ile bir mahkumun öyküsünü anlatıyor. Paul Edgecombun hapishanedeki görevi, idama mahkum edilen mahkumları son yolculuklarına uğurlamaktır. Çalıştığı yıllar içerisinde yüzlerce mahkumu idam etmiştir. Bir gün John Coffey isimli korkutucu görünümlü bir adamla tanışır. Ancak Coffeyin bu ürkütücü görünümünün altında oldukça saf bir ruh yatmaktadır. Coffey, iki küçük kız çocuğunun katil davasında yargılanmaktadır. Coffeyin günden güne gün yüzüne çıkan dünya ötesi güçleri, karakteri hakkında yeni ipuçlarını anbean ortaya çıkaracaktır."
		
	},
	{
		"FilmName": "Marriage Story",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/marriage.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/marriageHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "2sa 17dk",
		"ReleaseDate": "7 Nisan 2019",
		"Director": "Noah Baumbach",
		"IMDB": "7,9",
		"Plot": "Marriage Story, evli bir çiftin New Yorktan Los Angelesa kadar uzanan boşanma hikayesini konu ediyor. Bir yönetmen olan Charlie ve oyuncu olan eşi Nicole, evliliklerinde sona gelen bir çiftir. Boşanmaya karar veren çift, bu süreci kolayca sona erdirmeyi düşünse de işler pek de düşündükleri gibi gitmez. Çocuklarının velayeti işin içine girince, süreç beklediklerinden daha karmaşık bir hal alr. Çiftin bu sırada hayalarına farklı şehirlerde yön vermeye çalışması, işlerin iyice kızışmasına neden olur. Carlie projelerini sürdürmek için New Yorkta kalmak isterken, Nicole ise kadrosuna katıldığı televizyon dizisi için Los Angelesta yaşamayı planlar. Uzun zaman boyunca içlerinde gömülü kalmış kızgınlıklar da bu giderek agresifleşen boşanma sürecinde ortaya çıkmaya başlar."
	},
	{
		"FilmName": "Bitirim İkili",
		"Country": "ABD, Çin",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/rushour1.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/RushHourHeader.png",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 35dk",
		"ReleaseDate": "8 Ocak 1999",
		"Director": "Brett Ratner",
		"IMDB": "7,0",
		"Plot": "Bitirim İkilide, Hong Kong polis departmanın başarılı elemanlarından biri olan Dedektif Lee, son yürüttüğü görevde Çin kültürü için büyük bir önem arz eden değerli bir hazineyi hırsızların elinden kurtarmış; böylece üstleri tarafından milli bir kahraman olarak addedilmiştir. Kısa bir süre sonra gizli ve tehlikeli bir göreve atınan Lee, Amerikaya gidecek; burada Çin konsolosu Hanın kaçırılan kızını bulmakla görevlendirilecektir. Lee için son derece mühim olan bu görev, kendisine göz kulak olması için gönderilen Amerikan polis James Carterın gelişiyle çeşitli talihsizliklerle dolu eğlenceli bir maceraya dönüşecektir. Dönemin en sevilen komedilerinden biri olan Bitirim İkili, ardından çekilen devam filmleriyle eğlenceli bir seriye dönüştürülmüştü."
	},
	{
		"FilmName": "Bitirim İkili 2",
		"Country": "ABD, Çin",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/rushour2.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/RushHour2Header.png",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 30dk",
		"ReleaseDate": "26 Ekim 2001",
		"Director": "Brett Ratner",
		"IMDB": "6,6",
		"Plot": "Çok ses getiren ilk filmi Bitirim İkili ile tanıdığımız Lee ve Carter tekrar iş başındalar! Fakat bu kez Carter tatilini geçirmek için Hong Konga gidiyor. Her zaman olduğu gibi herhangi bir belaya ratladığında rahat duramayan Lee, bu kez oldukça büyük bir belanın kokusunu alıyor. Carter tatilini yaparken Lee azılı bir çetenin peşine düşüyor ve Carterı da tatilinden etmeyi başarıyor! Eski bir ajan olan Ricky, bağlı bulunduğu çetenin terör faaliyetleri doğrultusunda adreslerine paket göndererek çoğu kişiyi öldürür. Lee ve Cartera ise bu işe bir dur demek düşer. Hong Kongta başlayıp Los Angelesta devam edecek olan bu macera her zamanki gibi hem tehlikeli hem de eğlenceli durumlara gebe oluyor."
	},
	{
		"FilmName": "Bitirim İkili 3",
		"Country": "ABD, Çin, Fransa",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/rushour3.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/RushHour3Header.png",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 30dk",
		"ReleaseDate": "5 Ekim 2007",
		"Director": "Brett Ratner",
		"IMDB": "6,2",
		"Plot": "Büyükelçi Hana yapılan suikast girişiminin ardından Dedektif Lee ile Dedektif Carter, yeniden harekete geçerek Parise doğru yola çıkarlar. Bir Fransız kadınını koruyacaklardır. Lee, Birleşmiş Milletler ile gizli toplantılar yapar. Ancak kendisinin Kenji adındaki Çinli bir suçlu ile de mücadelesi aracılığı ile Leenin uzun zamandır kayıp olan erkek kardeşi de açığa çıkar. Ciddi anlamda kapsamlı bir suç örgütünü ortadan kaldırmak üzere Parise gelen bu ikili, aynı zamanda Büyükelçi Han’ın kızı Soo Yungu da kurtarmaya çalışırlar. Elbette yabancı oldukları bu şehirde her şey, alıştıklarından farklı bir biçimde gelişmektedir."
	},
	{
		"FilmName": "Bebek Firarda",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/baby.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/babyHeader.jpg",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 39dk",
		"ReleaseDate": "1 Temmuz 1994",
		"Director": "Patrick Read Johnson",
		"IMDB": "6,2",
		"Plot": "Üç beceriksiz fidyeci tarafından kaçırılan şirin bir bebeğin başından geçen komik olayları anlatan enfes bir komedi. Birilerinin bebekleri koruduğu kesin!"
	},
	{
		"FilmName": "Dumb and Dumber",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dumb.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dumbHeader.jpg",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 46dk",
		"ReleaseDate": "-1994",
		"Director": "Peter Farrelly, Bobby Farrelly",
		"IMDB": "7,3",
		"Plot": "Llyod Christmas ve Harry Dunne kirli ve dağınık bir evde yaşıyan, sık sık işlerinden kovulan birbirinden avanak iki arkadaştır. Llyod Rhode Islandda limuzin şöförlüğü yapmakta iken bir gün güzel ve zengin bir kadın olan Mary Swansonı havaalanına götürür, bu esnada ona aşık olur. Mary havaalanında bir çanta unutur, çantayı alan Llyod Marynin gözüne girme umuduyla çantasını ona geri götürmeyi kafasına koyar. Llyod malum sebeplerle Marynin ulaşacağı uçağa yetişmeyi beceremez. Bunun üzerine ikili Harrynin yeni (ve başarısız) köpek işi için bir köpek şeklinde dekore ettiği kamyonuyla Maryi Aspen’da bulmaya çalışır. Bilmedikleri gerçek ise çantanın parayla dolu olduğu ve Marynin onu havaalanında kaçırılan kocasının hayatını kurtarmak için fidye olarak bıraktığıdır..."
	},
	{
		"FilmName": "Bohemian Rhapsody",
		"Country": "ABD, İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/BohemianRhapsody.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/BohemianRhapsodyHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 15dk",
		"ReleaseDate": "2 Kasım 2018",
		"Director": "Bryan Singer",
		"IMDB": "7,9",
		"Plot": "Bohemian Rhapsody, Queen grubuna, müziklerine, klişelere meydan okuyan ve kuralları yıkarak dünyanın en sevilen sanatçılarından biri haline gelen ikonik solistlerine bir saygı duruşu niteliği taşıyor. Film, simgeleşmiş şarkıları ve devrimci sesiyle grubun meteorik yükselişine, Mercury'nin yaşam tarzının kontrolden çıkması ile çıkan iç çatışmaya ve yaşamını tehdit eden hastalığına rağmen Mercurynin rock müzik tarihinin en büyük performanslarından birinde gruba liderlik ettiği Live Aid konserinin arifesinde muzaffer birleşme sürecine yayılıyor. Bu süreçte de, her zaman bir aile gibi olan ve günümüzde dışlanmışlara, hayalperestlere ve müzikseverlere ilham vermeye devam eden bir grubun mirasını süslüyor."
	},
	{
		"FilmName": "GoodFellas",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/goodfellas.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/goodfellasHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 25dk",
		"ReleaseDate": "22 Şubat 1990",
		"Director": "Martin Scorsese",
		"IMDB": "8,7",
		"Plot": "Sıkı Dostlarda, Henry Hill adında bir gangster, Jimmy Conway ve Tommy De Vito adlı iki arkadaşıyla birlikte bir soyguna kalkışır. Gözleri daha yukarda olan iki arkadaşı soyguna katılan diğerlerini öldürür ve mafya içinde yükselmeye başlarlar. Bu durum Henryi olumsuz etkilemiştir ve bu konuda birşeyler yapması gerekmektedir. Büyük usta Martin Scorsesenin başyapıtlarından biri olan Goodfellas, 1991 yılında 6 dalda Oscara aday gösterilmiş, en iyi yardımcı erkek oyuncu dalında Joe Pesciye ödül kazandırmıştı.Bu film gerçek bir hikayeden alınmıştır..."
	},
	{
		"FilmName": "Green Book",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenBook.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenBookHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 10dk",
		"ReleaseDate": "2 Mart 2019",
		"Director": "Peter Farrelly",
		"IMDB": "8,2",
		"Plot": "Yeşil Rehber, ünlü bir piyanist ve konser turu kapsamında onun şoförü olarak çalışan Tonynin hikayesini anlatıyor. Tony Lip, Bronxtaki bir İtalyan Amerikan mahallesinde yaşamaktadır. Ünlü Afro-Amerikalı piyanist Dr. Don Shirley ise konser turu için hazırlanmaktadır. Ünlü müzisyen tur kapsamında Manhattandan güneye doğru birçok yere gidecektir. Kendisi ile şehir şehir gezecek bir şoför arayışında olan Shirley, bir süredir işsiz olan Tonyi işe alır. Tony, yolculuk sırasında Afro-Amerikalılar için güvenli olan güzergahları kullanabilmek için The Green Book isimli kılavuzdan yardım alır. Dr Shirley ve Tony çıktıkları bu yolculukta ırkçılıkla, tehlikeyle ve beklenmedik nezaketle karşılaşır. İkili bu zorlu yolculuklarında farklılıklarını bir kenara bırakmak zorundadır. En İyi Film Oscarının sahibi olan Viggo Mortensen ile Ay Işığı filmi ile Oscarı kazanan Mahershala Alinin başrolünü üstlendiği dram türündeki filmin yönetmen koltuğunda Peter Farrelly oturuyor. Senaryosunu yönetmen Farrelly, BriHayes Curre ve Nick Vallelonganın birlikte kaleme aldığı filmin oyuncu kadrosunda Linda Cardellini, Don Stark, David An, Sebastian Maniscalco gibi isimler yer alıyor."
	},
	{
		"FilmName": "Lincoln",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/lincoln.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/lincolnHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 29dk",
		"ReleaseDate": "8 Eylül 2012",
		"Director": "Steven Spielberg",
		"IMDB": "7,3",
		"Plot": "Film, Amerika Birleşik Devletlerinin 16. Başkanı olan ve kuzey eyaletlerinde 1861-1865 yılları arasında yaşanan iç savaşa öncülük eden Lincolnun son dönemlerine ışık tutuyor. İç Savaşın hararetli günleri geride kalınca, Abraham Lincoln ile kabinesi arasında fikir ayrılıkları da su yüzüne çıkacaktır. En ciddi görüş ayrılığı ise kölelik konusunda yaşanacaktır... Senaryosunu Pulitzer Ödüllü tarihçi Doris Kearns Goodwinin çok satan kitabından ödüllü senarist Tony Kushnerin (Münih (Munich)) uyarladığı yapımın baş rolünde Daniel Day-Lewis yer alırken, yönetmen koltuğundaysa Steven Spielberg oturuyor. Filmin adı gelecek Oscar sezonu için şimdiden kulislerde dolaşıyor."
	},
	{
		"FilmName": "Schindler List",
		"Country": "ABD, Polonya, Almanya",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/schindler.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/schindlerHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "3sa 15dk",
		"ReleaseDate": "-1993",
		"Director": "Steven Spielberg",
		"IMDB": "8,9",
		"Plot": "Schindlerin Listesi, Oskar Schindler adlı bir Alman işadamının 2. Dünya Savaşı zamanında Polonyada kurduğu fabrikada Yahudi işçileri çalıştırması ve bu sayede 1100 Yahudinin hayatını kurtarmasını konu alıyor. Gerçek bir hayat hikayesinden uyarlanan film, ünlü yönetmen Steven Spielbergin en önemli yapıtları arasında sayılan ve ona Oscar kazandıran bir yapımdır. Film, 1994 yılında 12 dalda Oscara aday olmuş ve 7 dalda ödül kazanmıştı. Filmin kazandığı Oscarlar şöyle : En İyi Film, Yönetim, Kurgu, Sanat Yönetimi, Görüntü, Özgün Müzik ve Senaryo Uyarlaması."
	},
	{
		"FilmName": "Into The Wild",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/wild.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/wildHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 28dk",
		"ReleaseDate": "21 Nisan 2007",
		"Director": "Sean Penn",
		"IMDB": "8,1",
		"Plot": "Into the Wild, bir metropolden vahşi hayata, kirlilikten saflığa ve temizliğe dönüş hikayesidir. Önemli bir üniversiteden dereceyle mezun olan Christopher aynı zaman başarılı bir atlettir de. Mezuniyet sonrası verilen bir davette ailesine istediği hayatın bu olmadığını, bir şeylerin eksik ve yanlış olduğunu söyler. Genç adam tüm mal varlığını hayır kurumuna bağışlayıp sahip olduğu her şeyi evinde bırakarak bambaşka bir hayata doğru uzun bir yolculuğa çıkar. Alaskanın ıssız ormanlarında sona eren bu yolculuk esnasında ve sonrasında Christopher, hayatını kökünden değiştirecek bazı kişilerle tanışarak, hayatın anlamını ve ölümün kaçınılmazlığını en sert haliyle deneyimleyecektir. Ünlü oyuncu Sean Pennin yönetmenliğini üstlendiği, iki dalda Oscara aday gösterilen filmin başrollerinde Emile Hirsch ve Vince Vaughn bulunuyor..."
	},
	{
		"FilmName": "Skayfall",
		"Country": "İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/skyfall.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/skyfallHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "2sa 23dk",
		"ReleaseDate": "2 Kasım 2012",
		"Director": "Sam Mendes",
		"IMDB": "7,7",
		"Plot": "MI6 ciddi bir saldırıya uğrar ve kurumun değerleri temelden sarsılır. Me karşı sadakat testinden geçen ajan James Bond kişisel bedelleri ağır olsa da, tehdidi bulup her ne pahasına olursa olsun yok etmelidir. Zira MI6yı ciddi riske sürükleyen isim Silva adında gözü kara, gizemli bir adamdır... Sinema tarihinin en uzun soluklu aksiyon film serisi olan gizli ajan 007 James Bondun nefes kesen macerası bu sefer Türkiye, Çin ve İngiltere ekseninde geçiyor.Serinin 23. filmi olan Skyfall'da 2000li yılların son Bondu olarak Daniel Craigi izlerken ünlü aktöre M rolünde seyircinin alıştığı üzere Judi Dench, Silva rolünde Javier Bardem, hukümet görevlisi Mallory olarak Ralph Fiennes, seksi Bond kadınları olarak ajan Eve rolünde Naomie Harris ve Severine rolünde Bérénice Marlohe eşlik ediyor. Yönetmen koltuğunda Sam Mendes'in oturduğu filmin Türkiye dışındaki diğer çekim mekanları arasındaysa Şangay, Londra ve İskoçyanın kuzey bölgeleri yer alıyor."
	},
	{
		"FilmName": "Yolcu",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/yolcu.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/yolcuHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "1sa 44dk",
		"ReleaseDate": "12 Ocak 2018",
		"Director": "Jaume Collet-Serra",
		"IMDB": "6,3",
		"Plot": "Michael McCauley her gün işten eve, evden işe bir hayat yaşayan bir iş adamıdır. Aynı zamanda aile babası olan Michael'ın oldukça sıradan bir hayatı vardır. Ancak eşi ile mutlulukla sürdürdükleri evlilik hayatları bir gün tepetaklak olur. Her gün işe giderken kullandığı trende son durağa gelmeden gizemli bir yabancının kimliğini ortaya çıkarmak zorunda kalır. Bir komplonun içine düştüğünü fark eden Michael, kendisini ve diğer yolcuların hayatını kurtarmak için zamana karşı mücadele etmek zorundadır."
	},
	{
		"FilmName": "Taşıyıcı",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tasiyici.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tasiyiciHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "1sa 32dk",
		"ReleaseDate": "6 Aralık 2002",
		"Director": "Corey Yuen, Louis Leterrier",
		"IMDB": "6,8",
		"Plot": "Frank, hayatının bir kısmını bir özel operasyon biriminin önemli bir parçası olarak geçirmiştir. Artık bir paralı askerdir ve hangi görevi beğeniyorsa onu yerine getirmektedir. Üç adet altın kuralı vardır. Frank, anlaşmanın bozulmasından; kim için çalıştığının sorulmasından ve taşıdığı paketin içinde ne olduğunu öğrenmekten hiç hoşlanmaz. Aldığı son görevde taşıdığı paket de tıpkı diğerleri gibi bir pakettir. Ancak kazın ayağı aslında öyle değildir."
	},
	{
		"FilmName": "Shooter",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shooter.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shooterHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "2sa 4dk",
		"ReleaseDate": "11 Mayıs 2007",
		"Director": "Antoine Fuqua",
		"IMDB": "7,2",
		"Plot": "En iyi olduğu alanda artık işi bırakmış olup da tecrübesine ihtiyaç duyulan olmak. Mark Wahlberg, bir zamanların ün salmış kusursuz nişancılarındadır. Bu işleri bırakmış olmasına rağmen bir gün önemli bir son görev için kendisinden destek istenir. Mark, bu işi kabul ettiğinde kısa sürede görevin altında yatan esas hedefi kavrayacaktır. Kendisine görevi verenlerin esas amacı Amerikan Başkanına bir süikast düzenlemektir. Bu şartlar altında Markın misyonu tamamen değişir. Onun amacı artık bu komplonun sırlarını çözmek ve Başkanı başına geleceklerden yana korumaktır. Film, Point of Impact adlı romandan uyarlanmıştır."
	},
	{
		"FilmName": "John Wick",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWick.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWickHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "1sa 41dk",
		"ReleaseDate": "28 Kasım 2014",
		"Director": "David Leitch, Chad Stahelski",
		"IMDB": "7,4",
		"Plot": "John Wick, emekliye ayrılmış bir tetikçidir. Emekliliğinin tadını çıkarırken karısının yakalandığı amansız hastalıkla hayatı altüst olur. Karısından kendisine kalan en değerli varlığı ve can yoldaşı köpeğidir. Ancak evine dalan üç gangster onu da öldürür. Gansterlerden biri, mafya babası Viggo Tasarovun oğlu Josef Tasarov'dur ve Johnun daha önce birlikte çalıştığı bir adamdır. Artık kaybedecek hiçbir şeyi de kalmayan John Wickin tek istediği intikamdır ve New York sokaklarında düşmanlarıyla nefes kesen bir kovalamacanın içine girer. Yönetmenliğini David Leitch ve Chad Stahelski ikilisinin üstlendiği filmin başrolünde Keanu Reevus yer alıyor."
	},
	{
		"FilmName": "Jon Wick 2",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWick2.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWick2Header.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "2sa 3dk",
		"ReleaseDate": "10 Şubat 2017",
		"Director": "Chad Stahelski",
		"IMDB": "7,5",
		"Plot": "Emekliye ayrılmış olan John Wick can yoldaşı köpeğiyle sakin bir hayat sürmektedir. Ancak başına gelen kimi olaylar onu bir kez daha suç dünyasına iter. Bu kez bu uğurda Roma sokaklarını arşınlaması gerekecektir... Başarılı aksiyon filmi John Wickin devam filmi olacak John Wickin yönetmen koltuğunda Chad Stahelski oturuyor. Filmin başrolünde yine Keanu Reevesi izleyeceğiz. Filmin kadrosunda Ruby Rose, Bridget Moynahan, Ian McShane, Peter Stormare, Laurence Fishburne, John Leguizamo ve Common gibi isimler de yer alıyor."
	},
	{
		"FilmName": "Karayip Korsanları",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/karayipKorsanlari.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/karayipKorsanlariHeader.jpg",
		"Type": "Macera",
		"CategoryId" : 2,
		"Duration": "2sa 23dk",
		"ReleaseDate": "31 Ekim 2003",
		"Director": "Gore Verbinski",
		"IMDB": "8,0",
		"Plot": "Karayip Korsanları: Siyah İncinin Laneti, genç bir kızı kurtarmaya çalışan korsan Jack Sparrow ile demirci Will Turnerın maceralarını anlatıyor. Yerel vali Weatherby Swann'ın 12 yaşındaki kızı Elizabeth, Jamaicaya yaptığı deniz yolculuğu esnasında bir gemi enkazıyla karşılaşırlar. Bu enkazdan kurtulabilen tek kişi küçük Willdır. Elizabeth küçük çocuğun boynundaki altın madalyondan onun bir korsan olduğunu anlar, bu yüzden madalyonu alarak saklar. Yıllar sonra Elizabeth, azılı bir korsan olan Barbossa tarafından kaçırılır. Çılgın ve iyi yürekli bir korsan olan Jack Sparrow ise Elizabethin çocukluk arkadaşı Will Turnerla bir olur ve kızı kurtarmaya çalışırlar. Ancak bu gizemli madalyon hayalet gemiyi harete geçirerek gizemli incinin lanetini canlandıracaktır."
	},
	{
		"FilmName": "Indiana Jones Kamçılı Adam",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/indianaJones.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/indianaJonesHeader.jpg",
		"Type": "Macera",
		"CategoryId" : 2,
		"Duration": "1sa 58dk",
		"ReleaseDate": "-1984",
		"Director": "Steven Spielberg",
		"IMDB": "6,2",
		"Plot": "Indiana Jones: Kamçılı Adam, Harrison Fordun hala çıtır olarak kabul edilegeldiği yıllarda çekilen, aslında bir ticari sinema örneği olmasına rağmen, birçok sinemasever için bugün kült statüsü muamelesi gören, kelimenin ansiklopedik anlamında bir aksiyon filmi... Şangayda bir gece kulübündeki kargaşadan son anda kaçan Indiana Jones, yanında uzakdoğulu küçük yardımcısı ve istemeden kader birliği ettiği genç ve çekici şarkıcı Willie olduğu halde, kendisini Hindistanda bulur. Maceraperest arkeolog, küçük bir köydeki çocukları kaçırarak madende çalıştıran ve zulüm eden Thuggee tarikatıyla karşı karşıya gelir. Kana susamış bu şeytani tarikatın hedefi, yüz yıl önce İngiliz sömürgeciler tarafından yasaklanan korkunç eylemlerine devam etmek için madenlerde kaybolmuş olan kutsal elmasları bulmaktır. Serinin, ritmi en yüksek bu filminde, sinemaseverlere, zekice yönetilmiş soluk kesici serüven sahneleri ve heyecan dolu bir macera filmi konsepti vadediliyor..."
	},
	{
		"FilmName": "Gladiator",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/gladiator.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/gladiatorHeader.jpg",
		"Type": "Macera",
		"CategoryId" : 2,	
		"Duration": "2sa 35dk",
		"ReleaseDate": "19 Mayıs 2000",
		"Director": "Ridley Scott",
		"IMDB": "8,5",
		"Plot": "Gladyatörde, İmparator Marcus Aureliusun hüküm sürdüğü Romada bir general olan Maximus imparatorluğun hiyerarşik basamaklarında gitgide yükselmektedir. Babasının kendisini kayırmak yerine Maximus adındaki bu yabancıyı el üstünde tutması da tahtın asıl varisi olan Commodusu rahatsız etmektedir. Commodus, Maximus ve ailesinin öldürülmesi yönünde emrini çıkarmak için fazla beklemez. Ölümden zor kurtulan Maximus artık bir gladyatör olarak eğitilmek üzere arenaya gönderilir. Maximusun aklında tek bir istek vardır, Commodusu öldürmek ve ailesinin intikamını bir an önce almak. Ridley Scottın bol ödüllü filmi, gösterildiği sene hem gişedeki büyük başarısıyla hem de aldığı Oscarlarla isminden epeyce söz ettirmişti."
	},
	{
		"FilmName": "11.22.63",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/112263.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/112263Header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "1 sezon - 8 bölüm / 60dk",
		"ReleaseDate": "-2016",
		"Director": "Bridget Carpenter",
		"IMDB": "8,2",
		"Plot": "Bir zaman yolculuğu hikayesi anlatacak olan 11/22/63, lisede İngilizce öğretmeni olan Jake Epping karakterini merkeze alacak. Bir lokantanın deposunun geçmişe açıldığını fark eden ve zamanda geriye giden Epping, John F. Kennedy suikastını önlemeye çalışacak. Ancak işler çok geçmeden sarpa saracak; zira kahramanımız, Lee Harvey Oswald engeline takılacak ve hayatının aşkı ile karşılaşacak!"
	},
	{
		"FilmName": "Back to the Future",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/backtofuture.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/backtofutureHeader.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "1sa 56dk",
		"ReleaseDate": "21 Temmuz 1985",
		"Director": "Robert Zemeckis",
		"IMDB": "8,5",
		"Plot": "Geleceğe Dönüşte, deli dolu bilimadamı Dr. Brown zamanda yolculuğu mümkün kılan bir araba geliştirir. Bu makineyi ilk kullanan genç Marty ufak bir zamanlama yanlışıyla gelecek yerine geçmişe gönderilir. Otuz yıl öncesine dönen Martynin burada yaptığı bir hamle, kendi kaderini ilginç bir noktaya sürükleyebilecek bir hataya sebebiyet verir. Artık Martynin yapması gereken tek şey kendi doğumunu bile engelleyecek bu hatayı bir şekilde düzeltmeye çalışmak olacaktır. Zamanda yolculuk temalı filmlerin atalarından olan Geleceğe Dönüş hem yönetmeni Robert Zemeckisin hem de dönem sinemasının şahlandığı anlardan biridir. Gösterime girdiği dönem insanlığını bir hayli heyecanlandıran ve kısa bir süre sonra kült mertebesine erişmiş, o güne kadar hep tv dizilerinde yer alan başrol oyuncusu Michael J. Foxa da büyük ün getirmiştir."
	},
	{
		"FilmName": "Matrix",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/matrix.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/matrixHeader.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 15dk",
		"ReleaseDate": "3 Eylül 1999",
		"Director": "Lana Wachowski, Lilly Wachowski",
		"IMDB": "8,7",
		"Plot": "Bir yaşanan gerçek vardır, bir de yaşananın ötesinde olan gerçeklik... Biri rüya, diğeri ise Matrix! Neo,son derece tehlikeli bir adam olan Morpheusun gerçeği bildiğine inanmaktadır. Bir gece Neo, kendisini başka bir dünyaya götürebilecek güzel yabancı Trinity ile tanışır. Bu kızın götüreceği dünyada, Neo Morpheusu bulacak ve Matrix hakkında bir şeyler öğrenecektir. Neo, Tam olarak kavrayamadığı şeylerin yaşamını kontrol ettiğini biliyor.. Nedir bu Matrix?"
	},
	{
		"FilmName": "Inception",
		"Country": "ABD, İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/inception.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/inception_header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 28dk",
		"ReleaseDate": "30 Temmuz 2010",
		"Director": "Cristopher Nolan",
		"IMDB": "8,8",
		"Plot": "Leonardo DiCaprio bu yapımda, çok yetenekli bir hırsız olan Dom Cobb ile karşımızda. Uzmanlık alanı, zihnin en karanlık ve savunmasız olduğu rüya görme anında, bilinçaltının derinliklerindeki değerli sırları çekip çıkarmak ve onları çalmaktır. Cobb'un bu nadir insanlarda görülebilecek yeteneği, bu ender rastgelinebilecek mahareti, onu kurumsal casusluğun tehlikeli yeni dünyasında aranan bir oyuncu yapmıştır. Aynı zamanda bu durum onu uluslararası bir kaçak yapmış ve sevdiği herşeye malolmuştur. Cobb'a içinde bulunduğu durumdan kurtulmasını sağlayacak bir fırsat sunulur. Ona hayatını geri verebilecek son bir iş; tabi eğer imkansız 'başlangıç'ı tamamlayabilirse. Mükemmel soygun yerine, Cobb ve takımındaki profesyoneller bu sefer tam tersini yapmak zorundadır; görevleri bir fikri çalmak değil onu yerleştirmektir. Eğer başarırlarsa, mükemmel suç bu olacaktır."
	},
	{
		"FilmName": "Interstaller",
		"Country": "ABD, İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/interstaller.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/interstellar_header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 49dk",
		"ReleaseDate": "7 Kasım 2014",
		"Director": "Cristopher Nolan",
		"IMDB": "8,6",
		"Plot": "Yıldızlararası'nda, teknik bilgisi ve becerisi yüksek olan Cooper, geniş mısır tarlalarında çiftçilik yaparak geçinmektedir; amacı iki çocuğuna güvenli bir hayat sunmaktır. Onlarla yaşayan Büyükbaba Donald çocuklara göz kulak olurken, henüz 10 yaşındaki kızı Murph şaşırtıcı bir zekaya sahiptir. Geçmişte bıraktığı biliminsanı kariyerini özleyen Cooper'un karşısına bir gün beklenmedik bir teklif çıkar ve ailesinin, dahası insanlığın güvenliği için zorlu bir karar alması gerekir... Christopher Nolan'ın, Jonathan Nolan ile kaleme aldığı ve yönetmenliğini sırtladığı filmin yıldız oyunculardan oluşan oyuncu kadrosunda Matthew McConaughey, Anne Hathaway, Jessica Chastain, Matt Damon, Bill Irwin, John Lithgow ve Michael Caine gibi isimler yer alıyor. Bilimkurgunun yanı sıra dramatik öğeler de içeren filmin senaryosu Fizikçi Kip S. Thorne'nun evrendeki 'Solucan Delikleri' teorisinden ilham alıyor."
	},
	{
		"FilmName": "Tenet",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tenet.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tenet_header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 30dk",
		"ReleaseDate": "26 Ağustos 2020",
		"Director": "Cristopher Nolan",
		"IMDB": "7,6",
		"Plot": "Tenet, dünyayı büyük bir tehlikeden kurtarmak için savaşan bir kahramanın hikayesini konu ediyor. Gerçek zamanın ötesinde bir yerde uluslararası bir casusluk görevini yerine getirmeye çalışan kahraman, dünyayı kurtarabilmek için savaşmak zorunda kalır. Üçüncü Dünya Savaşı’ndan daha büyük bir tehlikeyi durdurmaya çalışan kahraman, casusun alacakaranlık dünyasında zorlu bir yolculuğa çıkar."
	},
	{
		"FilmName": "The Dark Knight",
		"Country": "ABD, İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/darkKnight.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dark_knight_header.jpg",
		"Type": "Gerilim",
		"CategoryId" : 7,
		"Duration": "2sa 32dk",
		"ReleaseDate": "25 Temmuz 2008",
		"Director": "Cristopher Nolan",
		"IMDB": "9,0",
		"Plot": "Kara Şövalye, halk için büyük bir tehdit oluşturan Joker’in ortaya çıkması ile kaosa dönen Gotham Sokakları’nın yeniden kurtarıcılığını üstlenen Batman’in hikayesini konu ediyor. Suç işleyenlerden arındırılan bir yer, bir zaman sonra yeniden tehdit altında kalabilir ve işte o zaman yeniden kolları sıvayacak olanların mücadelesi de daha keskin olarak hayata geçecektir. Batman, Teğmen Gordon ve Savcı Harvey Dent bir araya gelerek Gotham Sokakları’nda bu işi kotarmış olsalar da ansızın ortaya çıkan Joker, işleri fena halde bozar. Onun dehası ile baş etmek kolay olmayacaktır. Gotham eski karmaşa dolu günlerin eşiğindedir. Batman yeniden kurtarıcılığa soyunurken kendi varlığının bulduğu anlamı da sorgulamaya başlar. O aslında suçluların sayısını azaltıyor mudur yoksa çoğaltıyor mudur bunu gerçekten anlamak isteyecektir."
	},
	{
		"FilmName": "The Prestige",
		"Country": "ABD, İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/prestige.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/prestige_header.jpg",
		"Type": "Gerilim",
		"CategoryId" : 7,
		"Duration": "2sa 8dk",
		"ReleaseDate": "22 Aralık 2006",
		"Director": "Cristopher Nolan",
		"IMDB": "8,5",
		"Plot": "Prestij, birbirini alt etmeye çalışan iki sihirbazın hikayesini anlatıyor. 19.yy sonlarında Londra’da Robert Angier, sevgili eşi Julia McCullough ve Alfred Borden hem arkadaştırlar hem de bir sihirbazın asistanlarıdırlar. Bir gösteri esnasında Julia ölünce Robert, onun ölümünden Alfred’i suçlar ve birbirlerine düşman olurlar. Zaman içinde ikisi de hem ünlü olurlar hem de rakip sihirbazlara dönüşerek birbirlerinin sahne üstünde performansını sabote etmeye kalkışırlar. Alfred başarılı bir hile yapınca Robert, rakibinin sırrını çözmek konusunu takıntı halinde getirir ve trajik olaylar birbirini kovalar."
	},
	{
		"FilmName": "Memento",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/memento.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/memento_header.jpg",
		"Type": "Gerilim",
		"CategoryId" : 7,
		"Duration": "1sa 56dk",
		"ReleaseDate": "27 Temmuz 2001",
		"Director": "Cristopher Nolan",
		"IMDB": "8,4",
		"Plot": "Akıl Defteri, kısa süreli hafıza kaybı olan bir adamın karısını öldürenleri bulma çabasını konu ediyor. Leonard Shelby, ucuz otel odalarında konaklayan ve sadece nakit para kullanan biridir. Şık giysiler giyip, Jaguar marka araba kullanan Leonard, dışarıdan işadamı gibi görünmektedir. Fakat aslında hayatını karısına tecavüz edip öldüren kişiyi bulmak için adayan biridir. Ne yazık ki Leonard’ın bu yolda ciddi bir engeli vardır, yaşadığı, çok ender rastlanan ve tedavi edilemeyen bir tür hafıza kaybı. Her ne kadar hayatının 'kaza'’dan önceki dönemlerini hatırlayabiliyorsa da, bazen 15 dakika öncesinde nereye gittiğini ve nerede olduğunu bile unutabilmektedir."
	},
	{
		"FilmName": "Dunkirk",
		"Country": "ABD, Fransa, İngiltere, Hollanda",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dunkirk.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dunkirk_header.jpg",
		"Type": "Tarih",
		"CategoryId" : 8,	
		"Duration": "1sa 47dk",
		"ReleaseDate": "21 Temmuz 2017",
		"Director": "Cristopher Nolan",
		"IMDB": "7,9",
		"Plot": "Christopher Nolan'ın 2. Dünya Savaşı'nın kaderini belirleyen olaylardan biri olan Dunkerque Tahliyesi'ni konu edinen filmi, yüz binlerce İngiliz ve müttefik askerlerinin, düşman askerleri tarafından etrafının sarılması ile başlar. Arkaları deniz olan bir yerde sıkışan askerler, düşman saldırısına karşı çaresiz bir durumda kalırlar. Başrollerinde Mark Rylance, Kenneth Branagh ve Tom Hardy'nin yer aldığı filmin kadrosunda ayrıca Jack Lowden, Aneurin Barnard ve ilk kez film deneyimini yaşacak olan Fionn Whitehead ile Harry Styles da yer alıyor. Filmi kendi senaryosundan uyarlayacak olan yönetmene yapımcılık koltuğunda da Emma Thomas eşlik ediyor."
	},	
	{
		"FilmName": "Following",
		"Country": "İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/following.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/following_header.jpg",
		"Type": "Gerilim",
		"CategoryId" : 7,
		"Duration": "1sa 10dk",
		"ReleaseDate": "-1998",
		"Director": "Cristopher Nolan",
		"IMDB": "7,5",
		"Plot": "Yeni romanı için aradığı ilhamı bir türlü bulamamış genç yazar, sokaklarda dolaşıp insanların peşinde dolanmakta, kendine esin kaynağı aramaktadır. Bill takma adıyla dolaşan genç yazar, bir gün siyah takım elbiseli, şık giyimli bir adamın peşine takılır. Takıntı haline getirdiği Cobb ismindeki gençle sonunda tanışan Bill, Cobb'un profesyonel bir hırsız olduğunu öğrenir. Cobb'un yaşam tarzından çok etkilenen Bill, sarışın çekici bir kadınla da tanışınca yavaş yavaş ait olmadığı suç dünyasının içine çekilecektir. Christopher Nolan?ın ?femme fatale? temasından karanlık, daraltıcı mekan atmosferine kadar birçok klasik film-noir öğesi barındıran filmi Takip?te, yönetmen bu klasik temaları alıp daha ilk filminden oluşturduğu kendine has sinemacılığıyla birleştirip başarılı bir kolaj yapıyor. İlk yapıtı Following, gerek senaryosu, kurgusu, gerekse görüntülerinin kalitesiyle ileride ne kadar başarılı bir sinemacı olacağının ve kaliteli işlere imza atacağının sinyallerini vermiş. Nolan'ın filmi yok denecek kadar az bir bütçeyle, ailesini ve arkadaşlarını oynatarak çektiğini belirtelim."
	},
	{
		"FilmName": "Uykusuz (Insomnia)",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/insomnia.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/insomnia_header.jpg",
		"Type": "Gerilim",
		"CategoryId" : 7,
		"Duration": "1sa 56dk",
		"ReleaseDate": "25 Ekim 2002",
		"Director": "Cristopher Nolan",
		"IMDB": "7,2",
		"Plot": "Genç bir kızın esrarengiz bir şekilde öldürülmesinin ardından küçük Alaska kenti türlü haberlerle çalkalanmaktadır. Bu cinayetin ardında yatan gizemi çözmek için göreve getirilen Will Dormer ve Hap Eckhart isimli iki dedektif, Los Angeles'tan Alaska'ya doğru yolculuğa çıkarlar. Yaptıkları araştırmalar sonrasında bir şüpheliye ulaşan ikili, şüpheli yazar Walter Finch'in peşine düşer. Bu sırada yaşadıkları bir çatışma sonrasında Hap Eckhart ölür ve Finch de izini kaybettirir. Fazlasıyla öfke dolan Dormer yanına yeni bir yardımcı alarak intikam ve adalet peşinde koşmaya başlar. Filmin yönetmen koltuğunda 'Memento' filmiyle büyük bir ilgi toplayan Christopher Nolan bulunuyor."
	},
	{
		"FilmName": "Çelik Adam (Men of Steel)",
		"Country": "ABD, İngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/menofsteel.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/menofsteel_header.jpg",
		"Type": "Macera",
		"CategoryId" : 2,
		"Duration": "2sa 23dk",
		"ReleaseDate": "14 Haziran 2013",
		"Director": "Cristopher Nolan",
		"IMDB": "7,0",
		"Plot": "DC Comics'in en meşhur süper kahramanı olan Superman'in köklerine, geçmişine dönerek kahramana farklı bir bakış açısı getiren son filmin yönetmenliğini Zack Snyder üstleniyor; filmin senaryosu ise David S. Goyer'e ait. Filmde Clark Kent'i Henry Cavill, kötü adamı General Zod'u Michael Shannon canlandırırken kadrodaki diğer isimler arasında Lois Lane rolünde Amy Adams, Martha Kent rolünde Diane Lane, Jonathan Kent rolünde Kevin Costner ve Jor-El rolünde de Russell Crowe yer alıyor. Yeni Superman filminde Clark, nasıl kullanacağını hiç bilmediği, birtakım sıra dışı güçlere sahip bir çocuktur. Bir gün okul servisi bir kaza geçirip, içinde çocuklarla birlikte nehre uçar. Servisin içindekilerin ölmesine göz yumamayan Clark, güçlerini kullanarak herkesi kurtarır. Fakat bu olay onun diğerlerinden oldukça farklı bir çocuk olduğunu da bariz biçimde ortaya çıkartacaktır. Kendisini keşfestmek için çıktığı yolculuk, dünya insanlarına umut sembolü olması için de atacağı ilk adımdır..."
	},
	{
		"FilmName": "Prison Break",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/prison.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/prisonHeader.jpg",
		"Type": "Gerilim",
		"CategoryId" : 7,
		"Duration": "5 sezon - 84 bölüm / 42dk",
		"ReleaseDate": "2005-2017",
		"Director": "Paul Scheuring",
		"IMDB": "8,3",
		"Plot": "Haksız yere suçlandığını düşündüğü abisini hapishaneden kurtarmak isteyen Michael Scofield, nerdeyse kusursuz bir plan yapar. Lincoln Burrowsa yüklenen suç, kendilerini temize çıkarabilecekleri bir suç değildir. Devletin de işin içine karıştığını öğrendiklerinde kaçmaktan başka çareleri kalmaz. Michael planını uygulamaya sokar ve kaçış başlar."
	}
	
]