[
	{
		"FilmName": "Babam ve Oðlum",
		"Country": "Türkiye",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/babamveoglum.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/babamveoglumHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "1sa 48dk",
		"ReleaseDate": "18 Kasým 2005",
		"Director": "Çaðan Irmak",
		"IMDB": "8,3",
		"Plot": "Babam ve Oðlumda, 12 Eylül darbesinin yýktýðý hayatlardan birinde yetiþmektedir küçük Deniz. Annesini henüz doðmadan önce kaybetmiþ, bir gazetede yazar olarak çalýþan babasý tarafýndan mütevazi bir evde yetiþtirilmiþtir. Babasý dýþýnda tanýdýðý tek bir akrabasý bile yoktur. Taki babasý Sadýk, bir gün Denizi þaþýrtacak bir haberle gelene kadar... Deniz artýk babasýyla birlikte, hiç görmediði dedesinin yanýnda, küçük bir kasabada yaþayacaktýr. Köye vardýklarýnda Sadýk yýllar önce küstüðü babasýný ilk kez görüyordur. Aralarýndaki bu üskünlük kolay kolay geçecek cinsten bir durum deðildir. Sadýðýn dönüþ sebebini anlamlandýramayan aile bir yandan çok mutluyken diðer yandan tedirgindir de. Zamanla Deniz bu hiç görmediði ailesine alýþýrken ve her þey düzelmeye baþlamýþken yaþanan bir dram herkesi derinden etkileyecektir. Son dönem sinemamýzýn en dokunaklý filmlerinden biri olarak kabul gören Babam ve Oðlum kendi türünde klasikleþmeye aday filmlerden biri."
		
	},
	{
		"FilmName": "The Shawshank Redemption",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shawshank.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shawshankHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "2sa 22dk",
		"ReleaseDate": "10 Mart 1994",
		"Director": " Frank Darabont",
		"IMDB": "9,3",
		"Plot": "Esaretin Bedeli, Andy ve Red isimli iki mahkumun parmaklýklar ardýnda kurduklarý dünyanýn hikayesini anlatýyor. Andy Dufresne, genç ve baþarýlý bir bankerdir. Karýsýný ve karýsýnýn sevgilisini öldürmek suçundan yargýlanýr ve ömür boyu hapis cezasý alýr. Shawsank Hapishanesinde dayak, iþkence, tecavüz, her türlü durum yaþanmaktadýr fakat Andy gene de hayata baðlý ve iyimserdir. Bu tutumu etrafýndakileri de etkiler. Andy umutlu bakýþ açýsýyla çevresindeki tüm mahkumlarý, parmaklýklar arkasýnda bile özgür bir yaþam olabileceðine inandýrýr. Andy'nin bu çabalarýna ortak olacak bir arkadaþý da olacaktýr: Red.Bir Stephen King uyarlamasý olan filmde Morgan Freeman ve Tim Robbins baþrolde. Film, 1995'te, aralarýnda en iyi film adaylýðý da olmak üzere tam 7 dalda Oscara aday gösterildi."
	},
	{
		"FilmName": "The Intouchables",
		"Country": "Fransa",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/intouchables.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/intouchablesHeader.png",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "1sa 52dk",
		"ReleaseDate": "11 Mayýs 2011",
		"Director": "Eric Toledano, Olivier Nakache",
		"IMDB": "8,5",
		"Plot": "Can Dostum, felçi bir adam ve ona bakýcýlýk yapan gencin hikayesini anlatýyor. Zengin bir iþ adamý ve aristokrat olan Philippe, yamaç paraþütü yaparken geçirdiði kaza sonrasý felç olur ve boynundan aþaðýsý kullanamaz hale gelir. Driss ise hapishaneden henüz yeni çýkmýþ bir iþsizdir. Philippe 7 gün 24 saat boyunca bakýmýný üstlenmesi için Drissi evine yatýlý yardýmcý olarak alýnca ikisinin de dünyasý deðiþecektir. Normal þartlar altýnda hiçbir zaman yan yana gelmeyecek bu ikili iyisiyle kötüsüyle hayatýn tadýný beraber çýkarmaya baþlarlar. Fransada geçtiðimiz kasým ayýnda vizyona giren film, hayatta bir noktadan sonra kültür ve sýnýf farklýlýklarýnýn ortadan kalkmasý temasýna odaklanan ve dram-mizah arasýnda gidip gelen bir yapým. Fransýz sinemacýlar Olivier Nakache ve Eric Toledano'nun beraber yazýp yönettiði filmin baþrollerinde ise François Cluzet ve Omar Sy var."
	},
	{
		"FilmName": "Forrest Gump",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/forrest.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/forrestHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "2sa 20dk",
		"ReleaseDate": "11 Nisan 1994",
		"Director": "Robert Zemeckis",
		"IMDB": "8,8",
		"Plot": "Forrest Gump, düþük I.Q. sahibi genç bir adamdýr. Jenny ile tanýþtýðýnda ona aþýk olur. Gump aralarýnda Elvis Presley, Kennedy, Nixonýn da olduðu tarihsel kiþilerle kaza eseri tanýþýr ve 50’lerden 70lerin sonuna kadar gelen bir süre zarfýnda olaylar geliþir. Gump tamamen tesadüf olarak Vietnam savaþýna ve Amerikan yakýn tarihinin önemli olaylarýna þahitlik eder ve hatta rol alýr. Ancak bilmeden yaptýklarýnýn ne kadar önemli sonuçlarý olduðundan da haberi yoktur."
		
	},
	{
		"FilmName": "The Green Mile",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenMile.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenMileHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "3sa 9dk",
		"ReleaseDate": "17 Mart 1999",
		"Director": "Frank Darabont",
		"IMDB": "8,6",
		"Plot": "Yeþil Yol, bir hapishane görevlisi ile bir mahkumun öyküsünü anlatýyor. Paul Edgecombun hapishanedeki görevi, idama mahkum edilen mahkumlarý son yolculuklarýna uðurlamaktýr. Çalýþtýðý yýllar içerisinde yüzlerce mahkumu idam etmiþtir. Bir gün John Coffey isimli korkutucu görünümlü bir adamla tanýþýr. Ancak Coffeyin bu ürkütücü görünümünün altýnda oldukça saf bir ruh yatmaktadýr. Coffey, iki küçük kýz çocuðunun katil davasýnda yargýlanmaktadýr. Coffeyin günden güne gün yüzüne çýkan dünya ötesi güçleri, karakteri hakkýnda yeni ipuçlarýný anbean ortaya çýkaracaktýr."
		
	},
	{
		"FilmName": "Marriage Story",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/marriage.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/marriageHeader.jpg",
		"Type": "Dram",
		"CategoryId" : 1,
		"Duration": "2sa 17dk",
		"ReleaseDate": "7 Nisan 2019",
		"Director": "Noah Baumbach",
		"IMDB": "7,9",
		"Plot": "Marriage Story, evli bir çiftin New Yorktan Los Angelesa kadar uzanan boþanma hikayesini konu ediyor. Bir yönetmen olan Charlie ve oyuncu olan eþi Nicole, evliliklerinde sona gelen bir çiftir. Boþanmaya karar veren çift, bu süreci kolayca sona erdirmeyi düþünse de iþler pek de düþündükleri gibi gitmez. Çocuklarýnýn velayeti iþin içine girince, süreç beklediklerinden daha karmaþýk bir hal alr. Çiftin bu sýrada hayalarýna farklý þehirlerde yön vermeye çalýþmasý, iþlerin iyice kýzýþmasýna neden olur. Carlie projelerini sürdürmek için New Yorkta kalmak isterken, Nicole ise kadrosuna katýldýðý televizyon dizisi için Los Angelesta yaþamayý planlar. Uzun zaman boyunca içlerinde gömülü kalmýþ kýzgýnlýklar da bu giderek agresifleþen boþanma sürecinde ortaya çýkmaya baþlar."
	},
	{
		"FilmName": "Bitirim Ýkili",
		"Country": "ABD, Çin",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/rushour1.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/RushHourHeader.png",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 35dk",
		"ReleaseDate": "8 Ocak 1999",
		"Director": "Brett Ratner",
		"IMDB": "7,0",
		"Plot": "Bitirim Ýkilide, Hong Kong polis departmanýn baþarýlý elemanlarýndan biri olan Dedektif Lee, son yürüttüðü görevde Çin kültürü için büyük bir önem arz eden deðerli bir hazineyi hýrsýzlarýn elinden kurtarmýþ; böylece üstleri tarafýndan milli bir kahraman olarak addedilmiþtir. Kýsa bir süre sonra gizli ve tehlikeli bir göreve atýnan Lee, Amerikaya gidecek; burada Çin konsolosu Hanýn kaçýrýlan kýzýný bulmakla görevlendirilecektir. Lee için son derece mühim olan bu görev, kendisine göz kulak olmasý için gönderilen Amerikan polis James Carterýn geliþiyle çeþitli talihsizliklerle dolu eðlenceli bir maceraya dönüþecektir. Dönemin en sevilen komedilerinden biri olan Bitirim Ýkili, ardýndan çekilen devam filmleriyle eðlenceli bir seriye dönüþtürülmüþtü."
	},
	{
		"FilmName": "Bitirim Ýkili 2",
		"Country": "ABD, Çin",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/rushour2.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/RushHour2Header.png",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 30dk",
		"ReleaseDate": "26 Ekim 2001",
		"Director": "Brett Ratner",
		"IMDB": "6,6",
		"Plot": "Çok ses getiren ilk filmi Bitirim Ýkili ile tanýdýðýmýz Lee ve Carter tekrar iþ baþýndalar! Fakat bu kez Carter tatilini geçirmek için Hong Konga gidiyor. Her zaman olduðu gibi herhangi bir belaya ratladýðýnda rahat duramayan Lee, bu kez oldukça büyük bir belanýn kokusunu alýyor. Carter tatilini yaparken Lee azýlý bir çetenin peþine düþüyor ve Carterý da tatilinden etmeyi baþarýyor! Eski bir ajan olan Ricky, baðlý bulunduðu çetenin terör faaliyetleri doðrultusunda adreslerine paket göndererek çoðu kiþiyi öldürür. Lee ve Cartera ise bu iþe bir dur demek düþer. Hong Kongta baþlayýp Los Angelesta devam edecek olan bu macera her zamanki gibi hem tehlikeli hem de eðlenceli durumlara gebe oluyor."
	},
	{
		"FilmName": "Bitirim Ýkili 3",
		"Country": "ABD, Çin, Fransa",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/rushour3.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/RushHour3Header.png",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 30dk",
		"ReleaseDate": "5 Ekim 2007",
		"Director": "Brett Ratner",
		"IMDB": "6,2",
		"Plot": "Büyükelçi Hana yapýlan suikast giriþiminin ardýndan Dedektif Lee ile Dedektif Carter, yeniden harekete geçerek Parise doðru yola çýkarlar. Bir Fransýz kadýnýný koruyacaklardýr. Lee, Birleþmiþ Milletler ile gizli toplantýlar yapar. Ancak kendisinin Kenji adýndaki Çinli bir suçlu ile de mücadelesi aracýlýðý ile Leenin uzun zamandýr kayýp olan erkek kardeþi de açýða çýkar. Ciddi anlamda kapsamlý bir suç örgütünü ortadan kaldýrmak üzere Parise gelen bu ikili, ayný zamanda Büyükelçi Han’ýn kýzý Soo Yungu da kurtarmaya çalýþýrlar. Elbette yabancý olduklarý bu þehirde her þey, alýþtýklarýndan farklý bir biçimde geliþmektedir."
	},
	{
		"FilmName": "Bebek Firarda",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/baby.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/babyHeader.jpg",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 39dk",
		"ReleaseDate": "1 Temmuz 1994",
		"Director": "Patrick Read Johnson",
		"IMDB": "6,2",
		"Plot": "Üç beceriksiz fidyeci tarafýndan kaçýrýlan þirin bir bebeðin baþýndan geçen komik olaylarý anlatan enfes bir komedi. Birilerinin bebekleri koruduðu kesin!"
	},
	{
		"FilmName": "Dumb and Dumber",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dumb.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/dumbHeader.jpg",
		"Type": "Komedi",
		"CategoryId" : 4,
		"Duration": "1sa 46dk",
		"ReleaseDate": "-1994",
		"Director": "Peter Farrelly, Bobby Farrelly",
		"IMDB": "7,3",
		"Plot": "Llyod Christmas ve Harry Dunne kirli ve daðýnýk bir evde yaþýyan, sýk sýk iþlerinden kovulan birbirinden avanak iki arkadaþtýr. Llyod Rhode Islandda limuzin þöförlüðü yapmakta iken bir gün güzel ve zengin bir kadýn olan Mary Swansoný havaalanýna götürür, bu esnada ona aþýk olur. Mary havaalanýnda bir çanta unutur, çantayý alan Llyod Marynin gözüne girme umuduyla çantasýný ona geri götürmeyi kafasýna koyar. Llyod malum sebeplerle Marynin ulaþacaðý uçaða yetiþmeyi beceremez. Bunun üzerine ikili Harrynin yeni (ve baþarýsýz) köpek iþi için bir köpek þeklinde dekore ettiði kamyonuyla Maryi Aspen’da bulmaya çalýþýr. Bilmedikleri gerçek ise çantanýn parayla dolu olduðu ve Marynin onu havaalanýnda kaçýrýlan kocasýnýn hayatýný kurtarmak için fidye olarak býraktýðýdýr..."
	},
	{
		"FilmName": "Bohemian Rhapsody",
		"Country": "ABD, Ýngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/BohemianRhapsody.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/BohemianRhapsodyHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 15dk",
		"ReleaseDate": "2 Kasým 2018",
		"Director": "Bryan Singer",
		"IMDB": "7,9",
		"Plot": "Bohemian Rhapsody, Queen grubuna, müziklerine, kliþelere meydan okuyan ve kurallarý yýkarak dünyanýn en sevilen sanatçýlarýndan biri haline gelen ikonik solistlerine bir saygý duruþu niteliði taþýyor. Film, simgeleþmiþ þarkýlarý ve devrimci sesiyle grubun meteorik yükseliþine, Mercury'nin yaþam tarzýnýn kontrolden çýkmasý ile çýkan iç çatýþmaya ve yaþamýný tehdit eden hastalýðýna raðmen Mercurynin rock müzik tarihinin en büyük performanslarýndan birinde gruba liderlik ettiði Live Aid konserinin arifesinde muzaffer birleþme sürecine yayýlýyor. Bu süreçte de, her zaman bir aile gibi olan ve günümüzde dýþlanmýþlara, hayalperestlere ve müzikseverlere ilham vermeye devam eden bir grubun mirasýný süslüyor."
	},
	{
		"FilmName": "GoodFellas",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/goodfellas.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/goodfellasHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 25dk",
		"ReleaseDate": "22 Þubat 1990",
		"Director": "Martin Scorsese",
		"IMDB": "8,7",
		"Plot": "Sýký Dostlarda, Henry Hill adýnda bir gangster, Jimmy Conway ve Tommy De Vito adlý iki arkadaþýyla birlikte bir soyguna kalkýþýr. Gözleri daha yukarda olan iki arkadaþý soyguna katýlan diðerlerini öldürür ve mafya içinde yükselmeye baþlarlar. Bu durum Henryi olumsuz etkilemiþtir ve bu konuda birþeyler yapmasý gerekmektedir. Büyük usta Martin Scorsesenin baþyapýtlarýndan biri olan Goodfellas, 1991 yýlýnda 6 dalda Oscara aday gösterilmiþ, en iyi yardýmcý erkek oyuncu dalýnda Joe Pesciye ödül kazandýrmýþtý.Bu film gerçek bir hikayeden alýnmýþtýr..."
	},
	{
		"FilmName": "Green Book",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenBook.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/greenBookHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 10dk",
		"ReleaseDate": "2 Mart 2019",
		"Director": "Peter Farrelly",
		"IMDB": "8,2",
		"Plot": "Yeþil Rehber, ünlü bir piyanist ve konser turu kapsamýnda onun þoförü olarak çalýþan Tonynin hikayesini anlatýyor. Tony Lip, Bronxtaki bir Ýtalyan Amerikan mahallesinde yaþamaktadýr. Ünlü Afro-Amerikalý piyanist Dr. Don Shirley ise konser turu için hazýrlanmaktadýr. Ünlü müzisyen tur kapsamýnda Manhattandan güneye doðru birçok yere gidecektir. Kendisi ile þehir þehir gezecek bir þoför arayýþýnda olan Shirley, bir süredir iþsiz olan Tonyi iþe alýr. Tony, yolculuk sýrasýnda Afro-Amerikalýlar için güvenli olan güzergahlarý kullanabilmek için The Green Book isimli kýlavuzdan yardým alýr. Dr Shirley ve Tony çýktýklarý bu yolculukta ýrkçýlýkla, tehlikeyle ve beklenmedik nezaketle karþýlaþýr. Ýkili bu zorlu yolculuklarýnda farklýlýklarýný bir kenara býrakmak zorundadýr. En Ýyi Film Oscarýnýn sahibi olan Viggo Mortensen ile Ay Iþýðý filmi ile Oscarý kazanan Mahershala Alinin baþrolünü üstlendiði dram türündeki filmin yönetmen koltuðunda Peter Farrelly oturuyor. Senaryosunu yönetmen Farrelly, BriHayes Curre ve Nick Vallelonganýn birlikte kaleme aldýðý filmin oyuncu kadrosunda Linda Cardellini, Don Stark, David An, Sebastian Maniscalco gibi isimler yer alýyor."
	},
	{
		"FilmName": "Lincoln",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/lincoln.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/lincolnHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 29dk",
		"ReleaseDate": "8 Eylül 2012",
		"Director": "Steven Spielberg",
		"IMDB": "7,3",
		"Plot": "Film, Amerika Birleþik Devletlerinin 16. Baþkaný olan ve kuzey eyaletlerinde 1861-1865 yýllarý arasýnda yaþanan iç savaþa öncülük eden Lincolnun son dönemlerine ýþýk tutuyor. Ýç Savaþýn hararetli günleri geride kalýnca, Abraham Lincoln ile kabinesi arasýnda fikir ayrýlýklarý da su yüzüne çýkacaktýr. En ciddi görüþ ayrýlýðý ise kölelik konusunda yaþanacaktýr... Senaryosunu Pulitzer Ödüllü tarihçi Doris Kearns Goodwinin çok satan kitabýndan ödüllü senarist Tony Kushnerin (Münih (Munich)) uyarladýðý yapýmýn baþ rolünde Daniel Day-Lewis yer alýrken, yönetmen koltuðundaysa Steven Spielberg oturuyor. Filmin adý gelecek Oscar sezonu için þimdiden kulislerde dolaþýyor."
	},
	{
		"FilmName": "Schindler List",
		"Country": "ABD, Polonya, Almanya",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/schindler.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/schindlerHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "3sa 15dk",
		"ReleaseDate": "-1993",
		"Director": "Steven Spielberg",
		"IMDB": "8,9",
		"Plot": "Schindlerin Listesi, Oskar Schindler adlý bir Alman iþadamýnýn 2. Dünya Savaþý zamanýnda Polonyada kurduðu fabrikada Yahudi iþçileri çalýþtýrmasý ve bu sayede 1100 Yahudinin hayatýný kurtarmasýný konu alýyor. Gerçek bir hayat hikayesinden uyarlanan film, ünlü yönetmen Steven Spielbergin en önemli yapýtlarý arasýnda sayýlan ve ona Oscar kazandýran bir yapýmdýr. Film, 1994 yýlýnda 12 dalda Oscara aday olmuþ ve 7 dalda ödül kazanmýþtý. Filmin kazandýðý Oscarlar þöyle : En Ýyi Film, Yönetim, Kurgu, Sanat Yönetimi, Görüntü, Özgün Müzik ve Senaryo Uyarlamasý."
	},
	{
		"FilmName": "Into The Wild",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/wild.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/wildHeader.jpg",
		"Type": "Biyografi",
		"CategoryId" : 6,
		"Duration": "2sa 28dk",
		"ReleaseDate": "21 Nisan 2007",
		"Director": "Sean Penn",
		"IMDB": "8,1",
		"Plot": "Into the Wild, bir metropolden vahþi hayata, kirlilikten saflýða ve temizliðe dönüþ hikayesidir. Önemli bir üniversiteden dereceyle mezun olan Christopher ayný zaman baþarýlý bir atlettir de. Mezuniyet sonrasý verilen bir davette ailesine istediði hayatýn bu olmadýðýný, bir þeylerin eksik ve yanlýþ olduðunu söyler. Genç adam tüm mal varlýðýný hayýr kurumuna baðýþlayýp sahip olduðu her þeyi evinde býrakarak bambaþka bir hayata doðru uzun bir yolculuða çýkar. Alaskanýn ýssýz ormanlarýnda sona eren bu yolculuk esnasýnda ve sonrasýnda Christopher, hayatýný kökünden deðiþtirecek bazý kiþilerle tanýþarak, hayatýn anlamýný ve ölümün kaçýnýlmazlýðýný en sert haliyle deneyimleyecektir. Ünlü oyuncu Sean Pennin yönetmenliðini üstlendiði, iki dalda Oscara aday gösterilen filmin baþrollerinde Emile Hirsch ve Vince Vaughn bulunuyor..."
	},
	{
		"FilmName": "Skayfall",
		"Country": "Ýngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/skyfall.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/skyfallHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "2sa 23dk",
		"ReleaseDate": "2 Kasým 2012",
		"Director": "Sam Mendes",
		"IMDB": "7,7",
		"Plot": "MI6 ciddi bir saldýrýya uðrar ve kurumun deðerleri temelden sarsýlýr. Me karþý sadakat testinden geçen ajan James Bond kiþisel bedelleri aðýr olsa da, tehdidi bulup her ne pahasýna olursa olsun yok etmelidir. Zira MI6yý ciddi riske sürükleyen isim Silva adýnda gözü kara, gizemli bir adamdýr... Sinema tarihinin en uzun soluklu aksiyon film serisi olan gizli ajan 007 James Bondun nefes kesen macerasý bu sefer Türkiye, Çin ve Ýngiltere ekseninde geçiyor.Serinin 23. filmi olan Skyfall'da 2000li yýllarýn son Bondu olarak Daniel Craigi izlerken ünlü aktöre M rolünde seyircinin alýþtýðý üzere Judi Dench, Silva rolünde Javier Bardem, hukümet görevlisi Mallory olarak Ralph Fiennes, seksi Bond kadýnlarý olarak ajan Eve rolünde Naomie Harris ve Severine rolünde Bérénice Marlohe eþlik ediyor. Yönetmen koltuðunda Sam Mendes'in oturduðu filmin Türkiye dýþýndaki diðer çekim mekanlarý arasýndaysa Þangay, Londra ve Ýskoçyanýn kuzey bölgeleri yer alýyor."
	},
	{
		"FilmName": "Yolcu",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/yolcu.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/yolcuHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "1sa 44dk",
		"ReleaseDate": "12 Ocak 2018",
		"Director": "Jaume Collet-Serra",
		"IMDB": "6,3",
		"Plot": "Michael McCauley her gün iþten eve, evden iþe bir hayat yaþayan bir iþ adamýdýr. Ayný zamanda aile babasý olan Michael'ýn oldukça sýradan bir hayatý vardýr. Ancak eþi ile mutlulukla sürdürdükleri evlilik hayatlarý bir gün tepetaklak olur. Her gün iþe giderken kullandýðý trende son duraða gelmeden gizemli bir yabancýnýn kimliðini ortaya çýkarmak zorunda kalýr. Bir komplonun içine düþtüðünü fark eden Michael, kendisini ve diðer yolcularýn hayatýný kurtarmak için zamana karþý mücadele etmek zorundadýr."
	},
	{
		"FilmName": "Taþýyýcý",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tasiyici.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tasiyiciHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "1sa 32dk",
		"ReleaseDate": "6 Aralýk 2002",
		"Director": "Corey Yuen, Louis Leterrier",
		"IMDB": "6,8",
		"Plot": "Frank, hayatýnýn bir kýsmýný bir özel operasyon biriminin önemli bir parçasý olarak geçirmiþtir. Artýk bir paralý askerdir ve hangi görevi beðeniyorsa onu yerine getirmektedir. Üç adet altýn kuralý vardýr. Frank, anlaþmanýn bozulmasýndan; kim için çalýþtýðýnýn sorulmasýndan ve taþýdýðý paketin içinde ne olduðunu öðrenmekten hiç hoþlanmaz. Aldýðý son görevde taþýdýðý paket de týpký diðerleri gibi bir pakettir. Ancak kazýn ayaðý aslýnda öyle deðildir."
	},
	{
		"FilmName": "Shooter",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shooter.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/shooterHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "2sa 4dk",
		"ReleaseDate": "11 Mayýs 2007",
		"Director": "Antoine Fuqua",
		"IMDB": "7,2",
		"Plot": "En iyi olduðu alanda artýk iþi býrakmýþ olup da tecrübesine ihtiyaç duyulan olmak. Mark Wahlberg, bir zamanlarýn ün salmýþ kusursuz niþancýlarýndadýr. Bu iþleri býrakmýþ olmasýna raðmen bir gün önemli bir son görev için kendisinden destek istenir. Mark, bu iþi kabul ettiðinde kýsa sürede görevin altýnda yatan esas hedefi kavrayacaktýr. Kendisine görevi verenlerin esas amacý Amerikan Baþkanýna bir süikast düzenlemektir. Bu þartlar altýnda Markýn misyonu tamamen deðiþir. Onun amacý artýk bu komplonun sýrlarýný çözmek ve Baþkaný baþýna geleceklerden yana korumaktýr. Film, Point of Impact adlý romandan uyarlanmýþtýr."
	},
	{
		"FilmName": "John Wick",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWick.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWickHeader.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "1sa 41dk",
		"ReleaseDate": "28 Kasým 2014",
		"Director": "David Leitch, Chad Stahelski",
		"IMDB": "7,4",
		"Plot": "John Wick, emekliye ayrýlmýþ bir tetikçidir. Emekliliðinin tadýný çýkarýrken karýsýnýn yakalandýðý amansýz hastalýkla hayatý altüst olur. Karýsýndan kendisine kalan en deðerli varlýðý ve can yoldaþý köpeðidir. Ancak evine dalan üç gangster onu da öldürür. Gansterlerden biri, mafya babasý Viggo Tasarovun oðlu Josef Tasarov'dur ve Johnun daha önce birlikte çalýþtýðý bir adamdýr. Artýk kaybedecek hiçbir þeyi de kalmayan John Wickin tek istediði intikamdýr ve New York sokaklarýnda düþmanlarýyla nefes kesen bir kovalamacanýn içine girer. Yönetmenliðini David Leitch ve Chad Stahelski ikilisinin üstlendiði filmin baþrolünde Keanu Reevus yer alýyor."
	},
	{
		"FilmName": "Jon Wick 2",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWick2.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/johnWick2Header.jpg",
		"Type": "Aksiyon",
		"CategoryId" : 5,
		"Duration": "2sa 3dk",
		"ReleaseDate": "10 Þubat 2017",
		"Director": "Chad Stahelski",
		"IMDB": "7,5",
		"Plot": "Emekliye ayrýlmýþ olan John Wick can yoldaþý köpeðiyle sakin bir hayat sürmektedir. Ancak baþýna gelen kimi olaylar onu bir kez daha suç dünyasýna iter. Bu kez bu uðurda Roma sokaklarýný arþýnlamasý gerekecektir... Baþarýlý aksiyon filmi John Wickin devam filmi olacak John Wickin yönetmen koltuðunda Chad Stahelski oturuyor. Filmin baþrolünde yine Keanu Reevesi izleyeceðiz. Filmin kadrosunda Ruby Rose, Bridget Moynahan, Ian McShane, Peter Stormare, Laurence Fishburne, John Leguizamo ve Common gibi isimler de yer alýyor."
	},
	{
		"FilmName": "Karayip Korsanlarý",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/karayipKorsanlari.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/karayipKorsanlariHeader.jpg",
		"Type": "Macera",
		"CategoryId" : 2,
		"Duration": "2sa 23dk",
		"ReleaseDate": "31 Ekim 2003",
		"Director": "Gore Verbinski",
		"IMDB": "8,0",
		"Plot": "Karayip Korsanlarý: Siyah Ýncinin Laneti, genç bir kýzý kurtarmaya çalýþan korsan Jack Sparrow ile demirci Will Turnerýn maceralarýný anlatýyor. Yerel vali Weatherby Swann'ýn 12 yaþýndaki kýzý Elizabeth, Jamaicaya yaptýðý deniz yolculuðu esnasýnda bir gemi enkazýyla karþýlaþýrlar. Bu enkazdan kurtulabilen tek kiþi küçük Willdýr. Elizabeth küçük çocuðun boynundaki altýn madalyondan onun bir korsan olduðunu anlar, bu yüzden madalyonu alarak saklar. Yýllar sonra Elizabeth, azýlý bir korsan olan Barbossa tarafýndan kaçýrýlýr. Çýlgýn ve iyi yürekli bir korsan olan Jack Sparrow ise Elizabethin çocukluk arkadaþý Will Turnerla bir olur ve kýzý kurtarmaya çalýþýrlar. Ancak bu gizemli madalyon hayalet gemiyi harete geçirerek gizemli incinin lanetini canlandýracaktýr."
	},
	{
		"FilmName": "Indiana Jones Kamçýlý Adam",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/indianaJones.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/indianaJonesHeader.jpg",
		"Type": "Macera",
		"CategoryId" : 2,
		"Duration": "1sa 58dk",
		"ReleaseDate": "-1984",
		"Director": "Steven Spielberg",
		"IMDB": "6,2",
		"Plot": "Indiana Jones: Kamçýlý Adam, Harrison Fordun hala çýtýr olarak kabul edilegeldiði yýllarda çekilen, aslýnda bir ticari sinema örneði olmasýna raðmen, birçok sinemasever için bugün kült statüsü muamelesi gören, kelimenin ansiklopedik anlamýnda bir aksiyon filmi... Þangayda bir gece kulübündeki kargaþadan son anda kaçan Indiana Jones, yanýnda uzakdoðulu küçük yardýmcýsý ve istemeden kader birliði ettiði genç ve çekici þarkýcý Willie olduðu halde, kendisini Hindistanda bulur. Maceraperest arkeolog, küçük bir köydeki çocuklarý kaçýrarak madende çalýþtýran ve zulüm eden Thuggee tarikatýyla karþý karþýya gelir. Kana susamýþ bu þeytani tarikatýn hedefi, yüz yýl önce Ýngiliz sömürgeciler tarafýndan yasaklanan korkunç eylemlerine devam etmek için madenlerde kaybolmuþ olan kutsal elmaslarý bulmaktýr. Serinin, ritmi en yüksek bu filminde, sinemaseverlere, zekice yönetilmiþ soluk kesici serüven sahneleri ve heyecan dolu bir macera filmi konsepti vadediliyor..."
	},
	{
		"FilmName": "Gladiator",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/gladiator.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/gladiatorHeader.jpg",
		"Type": "Macera",
		"CategoryId" : 2,	
		"Duration": "2sa 35dk",
		"ReleaseDate": "19 Mayýs 2000",
		"Director": "Ridley Scott",
		"IMDB": "8,5",
		"Plot": "Gladyatörde, Ýmparator Marcus Aureliusun hüküm sürdüðü Romada bir general olan Maximus imparatorluðun hiyerarþik basamaklarýnda gitgide yükselmektedir. Babasýnýn kendisini kayýrmak yerine Maximus adýndaki bu yabancýyý el üstünde tutmasý da tahtýn asýl varisi olan Commodusu rahatsýz etmektedir. Commodus, Maximus ve ailesinin öldürülmesi yönünde emrini çýkarmak için fazla beklemez. Ölümden zor kurtulan Maximus artýk bir gladyatör olarak eðitilmek üzere arenaya gönderilir. Maximusun aklýnda tek bir istek vardýr, Commodusu öldürmek ve ailesinin intikamýný bir an önce almak. Ridley Scottýn bol ödüllü filmi, gösterildiði sene hem giþedeki büyük baþarýsýyla hem de aldýðý Oscarlarla isminden epeyce söz ettirmiþti."
	},
	{
		"FilmName": "11.22.63",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/112263.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/112263Header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "1 sezon - 8 bölüm / 60dk",
		"ReleaseDate": "-2016",
		"Director": "Bridget Carpenter",
		"IMDB": "8,2",
		"Plot": "Bir zaman yolculuðu hikayesi anlatacak olan 11/22/63, lisede Ýngilizce öðretmeni olan Jake Epping karakterini merkeze alacak. Bir lokantanýn deposunun geçmiþe açýldýðýný fark eden ve zamanda geriye giden Epping, John F. Kennedy suikastýný önlemeye çalýþacak. Ancak iþler çok geçmeden sarpa saracak; zira kahramanýmýz, Lee Harvey Oswald engeline takýlacak ve hayatýnýn aþký ile karþýlaþacak!"
	},
	{
		"FilmName": "Back to the Future",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/backtofuture.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/backtofutureHeader.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "1sa 56dk",
		"ReleaseDate": "21 Temmuz 1985",
		"Director": "Robert Zemeckis",
		"IMDB": "8,5",
		"Plot": "Geleceðe Dönüþte, deli dolu bilimadamý Dr. Brown zamanda yolculuðu mümkün kýlan bir araba geliþtirir. Bu makineyi ilk kullanan genç Marty ufak bir zamanlama yanlýþýyla gelecek yerine geçmiþe gönderilir. Otuz yýl öncesine dönen Martynin burada yaptýðý bir hamle, kendi kaderini ilginç bir noktaya sürükleyebilecek bir hataya sebebiyet verir. Artýk Martynin yapmasý gereken tek þey kendi doðumunu bile engelleyecek bu hatayý bir þekilde düzeltmeye çalýþmak olacaktýr. Zamanda yolculuk temalý filmlerin atalarýndan olan Geleceðe Dönüþ hem yönetmeni Robert Zemeckisin hem de dönem sinemasýnýn þahlandýðý anlardan biridir. Gösterime girdiði dönem insanlýðýný bir hayli heyecanlandýran ve kýsa bir süre sonra kült mertebesine eriþmiþ, o güne kadar hep tv dizilerinde yer alan baþrol oyuncusu Michael J. Foxa da büyük ün getirmiþtir."
	},
	{
		"FilmName": "Matrix",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/matrix.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/matrixHeader.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 15dk",
		"ReleaseDate": "3 Eylül 1999",
		"Director": "Lana Wachowski, Lilly Wachowski",
		"IMDB": "8,7",
		"Plot": "Bir yaþanan gerçek vardýr, bir de yaþananýn ötesinde olan gerçeklik... Biri rüya, diðeri ise Matrix! Neo,son derece tehlikeli bir adam olan Morpheusun gerçeði bildiðine inanmaktadýr. Bir gece Neo, kendisini baþka bir dünyaya götürebilecek güzel yabancý Trinity ile tanýþýr. Bu kýzýn götüreceði dünyada, Neo Morpheusu bulacak ve Matrix hakkýnda bir þeyler öðrenecektir. Neo, Tam olarak kavrayamadýðý þeylerin yaþamýný kontrol ettiðini biliyor.. Nedir bu Matrix?"
	},
	{
		"FilmName": "Inception",
		"Country": "ABD, Ýngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/inception.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/inception_header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 28dk",
		"ReleaseDate": "30 Temmuz 2010",
		"Director": "Cristopher Nolan",
		"IMDB": "8,8",
		"Plot": "Leonardo DiCaprio bu yapýmda, çok yetenekli bir hýrsýz olan Dom Cobb ile karþýmýzda. Uzmanlýk alaný, zihnin en karanlýk ve savunmasýz olduðu rüya görme anýnda, bilinçaltýnýn derinliklerindeki deðerli sýrlarý çekip çýkarmak ve onlarý çalmaktýr. Cobb'un bu nadir insanlarda görülebilecek yeteneði, bu ender rastgelinebilecek mahareti, onu kurumsal casusluðun tehlikeli yeni dünyasýnda aranan bir oyuncu yapmýþtýr. Ayný zamanda bu durum onu uluslararasý bir kaçak yapmýþ ve sevdiði herþeye malolmuþtur. Cobb'a içinde bulunduðu durumdan kurtulmasýný saðlayacak bir fýrsat sunulur. Ona hayatýný geri verebilecek son bir iþ; tabi eðer imkansýz 'baþlangýç'ý tamamlayabilirse. Mükemmel soygun yerine, Cobb ve takýmýndaki profesyoneller bu sefer tam tersini yapmak zorundadýr; görevleri bir fikri çalmak deðil onu yerleþtirmektir. Eðer baþarýrlarsa, mükemmel suç bu olacaktýr."
	},
	{
		"FilmName": "Interstaller",
		"Country": "ABD, Ýngiltere",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/interstaller.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/interstellar_header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 49dk",
		"ReleaseDate": "7 Kasým 2014",
		"Director": "Cristopher Nolan",
		"IMDB": "8,6",
		"Plot": "Yýldýzlararasý'nda, teknik bilgisi ve becerisi yüksek olan Cooper, geniþ mýsýr tarlalarýnda çiftçilik yaparak geçinmektedir; amacý iki çocuðuna güvenli bir hayat sunmaktýr. Onlarla yaþayan Büyükbaba Donald çocuklara göz kulak olurken, henüz 10 yaþýndaki kýzý Murph þaþýrtýcý bir zekaya sahiptir. Geçmiþte býraktýðý biliminsaný kariyerini özleyen Cooper'un karþýsýna bir gün beklenmedik bir teklif çýkar ve ailesinin, dahasý insanlýðýn güvenliði için zorlu bir karar almasý gerekir... Christopher Nolan'ýn, Jonathan Nolan ile kaleme aldýðý ve yönetmenliðini sýrtladýðý filmin yýldýz oyunculardan oluþan oyuncu kadrosunda Matthew McConaughey, Anne Hathaway, Jessica Chastain, Matt Damon, Bill Irwin, John Lithgow ve Michael Caine gibi isimler yer alýyor. Bilimkurgunun yaný sýra dramatik öðeler de içeren filmin senaryosu Fizikçi Kip S. Thorne'nun evrendeki 'Solucan Delikleri' teorisinden ilham alýyor."
	},
	{
		"FilmName": "Tenet",
		"Country": "ABD",
		"ImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tenet.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/metehanbarutcu/NetflixClone/main/tenet_header.jpg",
		"Type": "Bilimkurgu",
		"CategoryId" : 3,
		"Duration": "2sa 30dk",
		"ReleaseDate": "26 Aðustos 2020",
		"Director": "Cristopher Nolan",
		"IMDB": "7,6",
		"Plot": "Tenet, dünyayý büyük bir tehlikeden kurtarmak için savaþan bir kahramanýn hikayesini konu ediyor. Gerçek zamanýn ötesinde bir yerde uluslararasý bir casusluk görevini yerine getirmeye çalýþan kahraman, dünyayý kurtarabilmek için savaþmak zorunda kalýr. Üçüncü Dünya Savaþý’ndan daha büyük bir tehlikeyi durdurmaya çalýþan kahraman, casusun alacakaranlýk dünyasýnda zorlu bir yolculuða çýkar."
	}
	
]